In [ ]:
import matplotlib.pyplot as plt
from sklearn.metrics import classification_report
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
import numpy as np
import pandas as pd
from sklearn.model_selection import GridSearchCV
from sklearn.linear_model import LinearRegression
import statsmodels.api as sm

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df = pd.read_excel('./1_gaguA.xlsx')   #구,동  1인가구수 2인가구수데이터.(공공데이터에서 받고 직접 전처리 해놓은 데이터)
df

      gu dong  gagu_1  gagu_2
0    종로구  사직동    1125    1006
1    종로구  삼청동     363     296
2    종로구  부암동     995    1082
3    종로구  평창동    1252    1709
4    종로구  무악동     508     698
..   ...  ...     ...     ...
228  강동구  암사동    5809    6133
229  강동구  천호동   12255    9699
230  강동구  성내동    7863    6725
231  강동구  둔촌동    2509    3655
232  강동구   길동    5141    4738

[233 rows x 4 columns]

In [ ]:
del df['gu']  #gu 컬럼 삭제.
df

    dong  gagu_1  gagu_2
0    사직동    1125    1006
1    삼청동     363     296
2    부암동     995    1082
3    평창동    1252    1709
4    무악동     508     698
..   ...     ...     ...
228  암사동    5809    6133
229  천호동   12255    9699
230  성내동    7863    6725
231  둔촌동    2509    3655
232   길동    5141    4738

[233 rows x 3 columns]

In [ ]:
cleaner = pd.read_csv('./동에따른매장수.csv')  #동에 따른 코인세탁소 매장수 데이터
cleaner

    dong  other_address
0    신림동             38
1    화곡동             26
2    상계동             19
3    봉천동             18
4    상도동             18
..   ...            ...
165  교북동              1
166  후암동              1
167  용문동              1
168  우면동              1
169  문배동              1

[170 rows x 2 columns]

In [ ]:
result = pd.merge(df,cleaner,how='outer',on='dong')  # 두 데이터프레임 동기준으로 아우터조인으로 합치기.
result

    dong  gagu_1  gagu_2  other_address
0    사직동  1125.0  1006.0            NaN
1    삼청동   363.0   296.0            NaN
2    부암동   995.0  1082.0            NaN
3    평창동  1252.0  1709.0            NaN
4    무악동   508.0   698.0            1.0
..   ...     ...     ...            ...
259  도선동     NaN     NaN            1.0
260  내자동     NaN     NaN            1.0
261  교북동     NaN     NaN            1.0
262  우면동     NaN     NaN            1.0
263  문배동     NaN     NaN            1.0

[264 rows x 4 columns]

In [ ]:
result.to_excel('result.xlsx')  # 엑셀 파일로 저장. -> 가구데이터가 2016년 기준이므로 새로 생긴동을 빼버림(엑셀로 처리)

In [ ]:
AA = pd.read_excel('./result.xlsx')
AA

     Unnamed: 0 dong  gagu_1  gagu_2  other_address
0             0  사직동    1125    1006              0
1             1  삼청동     363     296              0
2             2  부암동     995    1082              0
3             3  평창동    1252    1709              0
4             4  무악동     508     698              1
..          ...  ...     ...     ...            ...
228         228  암사동    5809    6133              0
229         229  천호동   12255    9699              9
230         230  성내동    7863    6725              9
231         231  둔촌동    2509    3655              2
232         232   길동    5141    4738              7

[233 rows x 5 columns]

In [ ]:
BB = AA.fillna(0) #결측치 0 처리

In [ ]:
BB

     Unnamed: 0 dong  gagu_1  gagu_2  other_address
0             0  사직동    1125    1006              0
1             1  삼청동     363     296              0
2             2  부암동     995    1082              0
3             3  평창동    1252    1709              0
4             4  무악동     508     698              1
..          ...  ...     ...     ...            ...
228         228  암사동    5809    6133              0
229         229  천호동   12255    9699              9
230         230  성내동    7863    6725              9
231         231  둔촌동    2509    3655              2
232         232   길동    5141    4738              7

[233 rows x 5 columns]

In [ ]:
dfy = pd.DataFrame(BB, columns=["other_address"]) #종속변수
dfy

     other_address
0                0
1                0
2                0
3                0
4                1
..             ...
228              0
229              9
230              9
231              2
232              7

[233 rows x 1 columns]

In [ ]:
dfx = pd.DataFrame(BB, columns=["gagu_1","gagu_2"]) #독립변수
dfx

     gagu_1  gagu_2
0      1125    1006
1       363     296
2       995    1082
3      1252    1709
4       508     698
..      ...     ...
228    5809    6133
229   12255    9699
230    7863    6725
231    2509    3655
232    5141    4738

[233 rows x 2 columns]

In [ ]:
x_train,x_test,y_train,y_test =train_test_split(dfx,dfy,test_size=0.3)

In [ ]:
lr = LogisticRegression()
grid_values = {'C': [0.001,0.01,0.1,1,10,100,1000], 'max_iter':[500, 5000]}  #찾고자 하는 파라미터 형식
gscv = GridSearchCV(lr, param_grid=grid_values, return_train_score=True)
gscv.fit(x_train, y_train)
gscv.best_params_, gscv.best_index_, gscv.best_score_, gscv.best_estimator_

In [ ]:
lr = LinearRegression()
lr.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [ ]:
predictions = lr.predict(x_test)
lr.score(x_test, y_test)
from sklearn import metrics
metrics.r2_score(y_test, predictions)

0.5217369833060694

In [ ]:
 model = sm.OLS(dfy,dfx)
 result = model.fit()
 print(result.summary())

                                 OLS Regression Results
=======================================================================================
Dep. Variable:          other_address   R-squared (uncentered):                   0.590
Model:                            OLS   Adj. R-squared (uncentered):              0.587
Method:                 Least Squares   F-statistic:                              166.2
Date:                Fri, 14 Aug 2020   Prob (F-statistic):                    1.86e-45
Time:                        02:42:24   Log-Likelihood:                         -614.77
No. Observations:                 233   AIC:                                      1234.
Df Residuals:                     231   BIC:                                      1240.
Df Model:                           2
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
gagu_1         0.0005      0.000      4.212      0.000       0.000       0.001
gagu_2         0.0002      0.000      1.720      0.087   -3.36e-05       0.000
==============================================================================
Omnibus:                      267.474   Durbin-Watson:                   1.924
Prob(Omnibus):                  0.000   Jarque-Bera (JB):            17715.972
Skew:                           4.569   Prob(JB):                         0.00
Kurtosis:                      44.729   Cond. No.                         6.13
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

In [ ]:
result.predict(x_test)

173     4.357420
23      1.356184
67      3.604107
148    12.424863
155     9.143838
         ...
6       0.402639
164     1.647054
69      3.540927
141    15.697774
35      0.768598
Length: 70, dtype: float64

In [ ]:
from sklearn.svm import SVC
classifier = SVC(kernel = 'linear')
classifier.fit(dfx, dfy)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='linear',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)